Revit 2027 API
AdvancedWood.WoodGrowthPerlinProf Property
 The property labeled "Profile for growth perlin noise" from the "AdvancedWood" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string WoodGrowthPerlinProf { get; }
Public Shared ReadOnly Property WoodGrowthPerlinProf As String
	Get
public:
static property String^ WoodGrowthPerlinProf {
	String^ get ();
}
static member WoodGrowthPerlinProf : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyDouble".
See Also
Reference
AdvancedWood Class
Autodesk.Revit.DB.Visual Namespace